soap-webservice-crud/endpoints/soap/Employees/AddEmployees.txt

AddEmployees :

Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://www.example.com/soapwebservice/employees">
   <soapenv:Header/>
   <soapenv:Body>
      <emp:addEmployeesRequest>
         <emp:name>e1</emp:name>
         <emp:role>r1</emp:role>
      </emp:addEmployeesRequest>
   </soapenv:Body>
</soapenv:Envelope>

Response :

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns2:addEmployeesResponse xmlns:ns2="http://www.example.com/soapwebservice/employees">
         <ns2:serviceStatus>
            <ns2:statusCode>SUCCESS</ns2:statusCode>
            <ns2:message>Data Added Successfully</ns2:message>
         </ns2:serviceStatus>
         <ns2:employeeInfo>
            <ns2:employeeId>2</ns2:employeeId>
            <ns2:name>e1</ns2:name>
            <ns2:role>r1</ns2:role>
         </ns2:employeeInfo>
      </ns2:addEmployeesResponse>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>